# комментарий по раздельной компиляции проекта с проверкой даты последнего изменения в проекте
#Сборка проекта List элементов типа Т
# все файлы должны лежать в одной директории, собирается проект командой make (minGW32-make)
# T может быть базовым типом или определяться в my.h
# list.h --объявление класса List, list.cpp -- реализация методов списка
# main_list.cpp -- тест на список
# my.h -- объявление пользовательского класса, my.cpp -- реализации
# В классе, объявленном в my.h, должны быть определены
# конструтор без параметров и конструктор с параметром int
# для проверки утечек по Староверову скачать файл malloc.cpp

a.exe:main_list.o list.o my.o  malloc.o
# проверка дат создания и наличия a.exe(цели) и main_list.0....(источников)
#и  наличия источников для каждого источника
	wg++ -fno-elide-constructors -std=c++11 list.o main_list.o my.o malloc.o
#сборка выполняется, только когда обновлены все источники

main_list.o:main_list.cpp list.h  my.h
#то же, что в 1 строке, здесь источники не являются целями
	wg++ -fno-elide-constructors -std=c++11  main_list.cpp -c
#компиляция выполняется, только если один из источников младше цели 

# также, как и в предыдущем разделе
list.o:list.cpp list.h   my.h
	wg++ -fno-elide-constructors -std=c++11  list.cpp  -c

# также, как и в предыдущем разделе
my.o:my.cpp my.h
	wg++ -fno-elide-constructors -std=c++11  my.cpp  -c

# также, как и в предыдущем разделе
malloc.o:malloc.cpp
	g++ malloc.cpp -c

